---
kind: type
id: T:Autodesk.Revit.DB.GeometryCreationUtilities
source: html/e829700d-48ff-0914-b288-5ceb93d8ee86.htm
---
# Autodesk.Revit.DB.GeometryCreationUtilities

A utility that allows construction of basic solid shapes.

## Syntax (C#)
```csharp
public static class GeometryCreationUtilities
```

## Remarks
The shapes created by these utilities are not a part of any Revit document,
 but can be used in conjunction with other geometric utilities from within API applications.